This isn't working for me on 5.6.0 and 5.7.0 using OpenTofu 1.10.2.
Resources:
```terraform
resource "cloudflare_zero_trust_tunnel_cloudflared" "test" {
  account_id    = "REDACTED"
  name          = "testtest"
  config_src    = "cloudflare"
}

resource "cloudflare_zero_trust_tunnel_cloudflared_route" "test" {
  account_id = "REDACTED"
  tunnel_id  = cloudflare_zero_trust_tunnel_cloudflared.test.id
  network    = "10.0.0.1/32"
}
```

Output of `tofu apply`:
```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_tunnel_cloudflared_route.test will be updated in-place
  ~ resource "cloudflare_zero_trust_tunnel_cloudflared_route" "test" {
      ~ created_at         = "2025-07-15T04:38:40Z" -> (known after apply)
      + deleted_at         = (known after apply)
        id                 = "REDACTED"
      ~ virtual_network_id = "REDACTED" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_zero_trust_tunnel_cloudflared_route.test: Modifying... [id=REDACTED]
╷
│ Error: failed to make http request
│
│   with cloudflare_zero_trust_tunnel_cloudflared_route.test,
│   on main.tf line 60, in resource "cloudflare_zero_trust_tunnel_cloudflared_route" "test":
│   60: resource "cloudflare_zero_trust_tunnel_cloudflared_route" "test" {
│
│ PATCH "https://api.cloudflare.com/client/v4/accounts/REDACTED/teamnet/routes/REDACTED": 500 Internal Server Error
│ {"success":false,"errors":[{"code":1000,"message":"Internal server error"}],"messages":[],"result":null}
```